perf/results/root/node_load_output.txt
> artillery "run" "./scenarios/root_load.yaml" "-e" "gunicorn"

Started phase 0 (Plain), duration: 20s @ 00:32:22(-0300) 2020-11-12
Report @ 00:32:32(-0300) 2020-11-12
Elapsed time: 10 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Report @ 00:32:42(-0300) 2020-11-12
Elapsed time: 20 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Started phase 1 (Ramp Up 1), duration: 10s @ 00:32:42(-0300) 2020-11-12
Report @ 00:32:52(-0300) 2020-11-12
Elapsed time: 30 seconds
  Scenarios launched:  44
  Scenarios completed: 44
  Requests completed:  44
  Mean response/sec: 4.68
  Response time (msec):
    min: 1.6
    max: 13.4
    median: 3.2
    p95: 5.8
    p99: 13.4
  Codes:
    200: 44

Started phase 2 (Ramp Up 2), duration: 10s @ 00:32:53(-0300) 2020-11-12
Report @ 00:33:02(-0300) 2020-11-12
Elapsed time: 40 seconds
  Scenarios launched:  140
  Scenarios completed: 140
  Requests completed:  140
  Mean response/sec: 14.06
  Response time (msec):
    min: 1.6
    max: 34
    median: 4.4
    p95: 5.3
    p99: 8.8
  Codes:
    200: 140

Started phase 3 (Ramp Up 3), duration: 10s @ 00:33:03(-0300) 2020-11-12
Report @ 00:33:12(-0300) 2020-11-12
Elapsed time: 50 seconds
  Scenarios launched:  235
  Scenarios completed: 235
  Requests completed:  235
  Mean response/sec: 23.5
  Response time (msec):
    min: 1.6
    max: 72.9
    median: 4.4
    p95: 5.9
    p99: 35.5
  Codes:
    200: 235

Started phase 4 (Ramp Up 4), duration: 10s @ 00:33:14(-0300) 2020-11-12
Report @ 00:33:22(-0300) 2020-11-12
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  331
  Scenarios completed: 331
  Requests completed:  331
  Mean response/sec: 33.17
  Response time (msec):
    min: 1.6
    max: 29.8
    median: 4.4
    p95: 5.3
    p99: 11
  Codes:
    200: 331

Started phase 5 (Ramp Up 5), duration: 10s @ 00:33:24(-0300) 2020-11-12
Report @ 00:33:32(-0300) 2020-11-12
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  431
  Scenarios completed: 431
  Requests completed:  431
  Mean response/sec: 43.1
  Response time (msec):
    min: 1.5
    max: 42.4
    median: 4.4
    p95: 5.7
    p99: 9.2
  Codes:
    200: 431

Started phase 6 (Ramp Up 6), duration: 10s @ 00:33:34(-0300) 2020-11-12
Report @ 00:33:42(-0300) 2020-11-12
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  519
  Scenarios completed: 519
  Requests completed:  519
  Mean response/sec: 51.85
  Response time (msec):
    min: 1.5
    max: 11.8
    median: 4.3
    p95: 5.3
    p99: 8
  Codes:
    200: 519

Started phase 7 (Ramp Up 7), duration: 10s @ 00:33:44(-0300) 2020-11-12
Report @ 00:33:52(-0300) 2020-11-12
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  624
  Scenarios completed: 623
  Requests completed:  623
  Mean response/sec: 62.59
  Response time (msec):
    min: 1.5
    max: 21.9
    median: 4.4
    p95: 7.1
    p99: 12.7
  Codes:
    200: 623

Started phase 8 (Ramp Up 8), duration: 10s @ 00:33:54(-0300) 2020-11-12
Report @ 00:34:02(-0300) 2020-11-12
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  727
  Scenarios completed: 728
  Requests completed:  728
  Mean response/sec: 72.85
  Response time (msec):
    min: 1.5
    max: 25.8
    median: 4.4
    p95: 8.2
    p99: 13
  Codes:
    200: 728

Started phase 9 (Ramp Up 9), duration: 10s @ 00:34:04(-0300) 2020-11-12
Report @ 00:34:12(-0300) 2020-11-12
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  833
  Scenarios completed: 833
  Requests completed:  833
  Mean response/sec: 83.3
  Response time (msec):
    min: 1.5
    max: 170.3
    median: 3.8
    p95: 9
    p99: 113.1
  Codes:
    200: 833

Started phase 10 (Ramp Up 10), duration: 10s @ 00:34:14(-0300) 2020-11-12
Report @ 00:34:22(-0300) 2020-11-12
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  927
  Scenarios completed: 926
  Requests completed:  926
  Mean response/sec: 92.6
  Response time (msec):
    min: 1.5
    max: 30.8
    median: 3.5
    p95: 10
    p99: 18.8
  Codes:
    200: 926

Started phase 11 (Ramp Up 11), duration: 10s @ 00:34:24(-0300) 2020-11-12
Report @ 00:34:32(-0300) 2020-11-12
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  1021
  Scenarios completed: 1021
  Requests completed:  1021
  Mean response/sec: 102.3
  Response time (msec):
    min: 1.5
    max: 32.9
    median: 3.2
    p95: 12.3
    p99: 17.9
  Codes:
    200: 1021

Started phase 12 (Ramp Up 12), duration: 10s @ 00:34:34(-0300) 2020-11-12
Report @ 00:34:42(-0300) 2020-11-12
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  1125
  Scenarios completed: 1126
  Requests completed:  1126
  Mean response/sec: 112.73
  Response time (msec):
    min: 1.4
    max: 180.1
    median: 2.8
    p95: 10.6
    p99: 91.6
  Codes:
    200: 1126

Started phase 13 (Ramp Up 13), duration: 10s @ 00:34:44(-0300) 2020-11-12
Report @ 00:34:52(-0300) 2020-11-12
Elapsed time: 2 minutes, 30 seconds
  Scenarios launched:  1226
  Scenarios completed: 1226
  Requests completed:  1226
  Mean response/sec: 122.6
  Response time (msec):
    min: 1.3
    max: 18.1
    median: 2.2
    p95: 7.4
    p99: 11.7
  Codes:
    200: 1226

Started phase 14 (Ramp Up 14), duration: 10s @ 00:34:54(-0300) 2020-11-12
Report @ 00:35:02(-0300) 2020-11-12
Elapsed time: 2 minutes, 40 seconds
  Scenarios launched:  1336
  Scenarios completed: 1336
  Requests completed:  1336
  Mean response/sec: 133.73
  Response time (msec):
    min: 1.4
    max: 16.7
    median: 2.3
    p95: 7.7
    p99: 10.8
  Codes:
    200: 1336

Started phase 15 (Ramp Up 15), duration: 10s @ 00:35:04(-0300) 2020-11-12
Report @ 00:35:12(-0300) 2020-11-12
Elapsed time: 2 minutes, 50 seconds
  Scenarios launched:  1425
  Scenarios completed: 1424
  Requests completed:  1424
  Mean response/sec: 142.64
  Response time (msec):
    min: 1.3
    max: 85.1
    median: 2.3
    p95: 9.2
    p99: 24.8
  Codes:
    200: 1424

Started phase 16 (Ramp Up 16), duration: 10s @ 00:35:14(-0300) 2020-11-12
Report @ 00:35:22(-0300) 2020-11-12
Elapsed time: 3 minutes, 0 seconds
  Scenarios launched:  1522
  Scenarios completed: 1522
  Requests completed:  1522
  Mean response/sec: 152.25
  Response time (msec):
    min: 1.3
    max: 27.9
    median: 2.2
    p95: 10.1
    p99: 16.4
  Codes:
    200: 1522

Started phase 17 (Ramp Up 17), duration: 10s @ 00:35:24(-0300) 2020-11-12
Report @ 00:35:32(-0300) 2020-11-12
Elapsed time: 3 minutes, 10 seconds
  Scenarios launched:  1619
  Scenarios completed: 1620
  Requests completed:  1620
  Mean response/sec: 162.16
  Response time (msec):
    min: 1.3
    max: 17.4
    median: 2.1
    p95: 8.9
    p99: 12.4
  Codes:
    200: 1620

Started phase 18 (Ramp Up 18), duration: 10s @ 00:35:34(-0300) 2020-11-12
Report @ 00:35:42(-0300) 2020-11-12
Elapsed time: 3 minutes, 20 seconds
  Scenarios launched:  1737
  Scenarios completed: 1736
  Requests completed:  1736
  Mean response/sec: 173.7
  Response time (msec):
    min: 1.3
    max: 41.7
    median: 2.2
    p95: 8.1
    p99: 11.6
  Codes:
    200: 1736

Started phase 19 (Ramp Up 19), duration: 10s @ 00:35:44(-0300) 2020-11-12
Report @ 00:35:52(-0300) 2020-11-12
Elapsed time: 3 minutes, 30 seconds
  Scenarios launched:  1818
  Scenarios completed: 1819
  Requests completed:  1819
  Mean response/sec: 181.98
  Response time (msec):
    min: 1.3
    max: 23.9
    median: 2.2
    p95: 6.8
    p99: 10.6
  Codes:
    200: 1819

Started phase 20 (Ramp Up 20), duration: 10s @ 00:35:54(-0300) 2020-11-12
Report @ 00:36:02(-0300) 2020-11-12
Elapsed time: 3 minutes, 40 seconds
  Scenarios launched:  1939
  Scenarios completed: 1938
  Requests completed:  1938
  Mean response/sec: 194.09
  Response time (msec):
    min: 1.2
    max: 18.4
    median: 2.1
    p95: 4.7
    p99: 10.5
  Codes:
    200: 1938

Started phase 21 (Ramp Up 21), duration: 10s @ 00:36:04(-0300) 2020-11-12
Report @ 00:36:12(-0300) 2020-11-12
Elapsed time: 3 minutes, 50 seconds
  Scenarios launched:  2021
  Scenarios completed: 2021
  Requests completed:  2021
  Mean response/sec: 202.2
  Response time (msec):
    min: 1.3
    max: 23.3
    median: 2.2
    p95: 7.5
    p99: 11
  Codes:
    200: 2021

Started phase 22 (Ramp Up 22), duration: 10s @ 00:36:14(-0300) 2020-11-12
Report @ 00:36:22(-0300) 2020-11-12
Elapsed time: 4 minutes, 0 seconds
  Scenarios launched:  2125
  Scenarios completed: 2125
  Requests completed:  2125
  Mean response/sec: 212.71
  Response time (msec):
    min: 1.2
    max: 16.3
    median: 2.1
    p95: 8.9
    p99: 12.3
  Codes:
    200: 2125

Started phase 23 (Ramp Up 23), duration: 10s @ 00:36:24(-0300) 2020-11-12
Report @ 00:36:32(-0300) 2020-11-12
Elapsed time: 4 minutes, 10 seconds
  Scenarios launched:  2224
  Scenarios completed: 2224
  Requests completed:  2224
  Mean response/sec: 222.5
  Response time (msec):
    min: 1.2
    max: 56.6
    median: 2.1
    p95: 8.6
    p99: 12.9
  Codes:
    200: 2224

Started phase 24 (Ramp Up 24), duration: 10s @ 00:36:35(-0300) 2020-11-12
Report @ 00:36:42(-0300) 2020-11-12
Elapsed time: 4 minutes, 20 seconds
  Scenarios launched:  2327
  Scenarios completed: 2327
  Requests completed:  2327
  Mean response/sec: 232.83
  Response time (msec):
    min: 1.2
    max: 34.7
    median: 2.1
    p95: 7.8
    p99: 11.7
  Codes:
    200: 2327

Started phase 25 (Ramp Up 215), duration: 10s @ 00:36:45(-0300) 2020-11-12
Report @ 00:36:52(-0300) 2020-11-12
Elapsed time: 4 minutes, 30 seconds
  Scenarios launched:  2427
  Scenarios completed: 2427
  Requests completed:  2427
  Mean response/sec: 243.04
  Response time (msec):
    min: 1.2
    max: 22.3
    median: 2.1
    p95: 7.2
    p99: 12.2
  Codes:
    200: 2427

Started phase 26 (Ramp Up 26), duration: 10s @ 00:36:55(-0300) 2020-11-12
Report @ 00:37:02(-0300) 2020-11-12
Elapsed time: 4 minutes, 40 seconds
  Scenarios launched:  2533
  Scenarios completed: 2534
  Requests completed:  2534
  Mean response/sec: 253.55
  Response time (msec):
    min: 1.2
    max: 30.7
    median: 2.1
    p95: 8.6
    p99: 13.6
  Codes:
    200: 2534

Started phase 27 (Ramp Up 27), duration: 10s @ 00:37:05(-0300) 2020-11-12
Report @ 00:37:12(-0300) 2020-11-12
Elapsed time: 4 minutes, 50 seconds
  Scenarios launched:  2623
  Scenarios completed: 2622
  Requests completed:  2622
  Mean response/sec: 262.46
  Response time (msec):
    min: 1.2
    max: 26.9
    median: 2.3
    p95: 11.6
    p99: 23
  Codes:
    200: 2622

Started phase 28 (Ramp Up 28), duration: 10s @ 00:37:15(-0300) 2020-11-12
Report @ 00:37:22(-0300) 2020-11-12
Elapsed time: 5 minutes, 0 seconds
  Scenarios launched:  2736
  Scenarios completed: 2736
  Requests completed:  2736
  Mean response/sec: 273.6
  Response time (msec):
    min: 1.2
    max: 31.5
    median: 2.5
    p95: 21.5
    p99: 27
  Codes:
    200: 2736

Started phase 29 (Ramp Up 29), duration: 10s @ 00:37:25(-0300) 2020-11-12
Report @ 00:37:32(-0300) 2020-11-12
Elapsed time: 5 minutes, 10 seconds
  Scenarios launched:  2824
  Scenarios completed: 2823
  Requests completed:  2823
  Mean response/sec: 282.78
  Response time (msec):
    min: 1.2
    max: 72.6
    median: 2.6
    p95: 29.6
    p99: 52.3
  Codes:
    200: 2823

Started phase 30 (Ramp Up 30), duration: 10s @ 00:37:35(-0300) 2020-11-12
Report @ 00:37:42(-0300) 2020-11-12
Elapsed time: 5 minutes, 20 seconds
  Scenarios launched:  2933
  Scenarios completed: 2932
  Requests completed:  2932
  Mean response/sec: 293.39
  Response time (msec):
    min: 1.2
    max: 64
    median: 2.8
    p95: 34.2
    p99: 55.8
  Codes:
    200: 2932

Started phase 31 (Plain), duration: 20s @ 00:37:45(-0300) 2020-11-12
Report @ 00:37:52(-0300) 2020-11-12
Elapsed time: 5 minutes, 30 seconds
  Scenarios launched:  862
  Scenarios completed: 865
  Requests completed:  865
  Mean response/sec: 86.4
  Response time (msec):
    min: 1.2
    max: 47.5
    median: 2.7
    p95: 28.2
    p99: 33
  Codes:
    200: 865

Report @ 00:38:02(-0300) 2020-11-12
Elapsed time: 5 minutes, 40 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Report @ 00:38:05(-0300) 2020-11-12
Elapsed time: 5 minutes, 43 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

All virtual users finished
Summary report - Gunicorn
  Scenarios launched:  45214
  Scenarios completed: 45214
  Requests completed:  45214
  Mean response/sec: 139.98
  Response time (msec):
    min: 1.2
    max: 180.1
    median: 2.3
    p95: 11.5
    p99: 30
  Scenario counts:
    Root (/): 45214 (100%)
  Codes:
    200: 45214